package proj04;


/*
4. 
10개의 상품을 판매하는 상점을 여러분이 운영하고 있다고 가정한다. 
예를 들어 화장품가게일 수도 있고, 과일가게일 수도 있으며, 카페일 수도 있다. 
여러분이 선호하는 가게를 선택하여 문제를 해결하기 바란다. 
여러분이 선정한 가게를 위한 판매관리 프로그램을 자바로 작성하고자 한다. 
판매관리 기본 메뉴에는 
1) 매출, 
2) 매입, 
3) 재고 
가 있다. 
기타 추가적인 메뉴항목은 여러분이 추가해도 무방하다. 
예를 들어 유효기간이 지난 상품정보, 반품상품 등을 들 수 있다. 
상품 각각은 객체로 설계하며 각 객체는 상품에 관한 정보를 가져야 한다. 
객체들의 배열을 사용하며, 배열 크기의 변화를 위해서는 copyOf() 메소드를 사용해도 좋다.

일단 프로그램이 실행되면 첫 화면에서 다음과 같은 메뉴가 나타난다. 
항목 선택이 된 이후부터는 각 팀의 판매관리 아이디어와 생각에 따라 실행 단계 및 화면 구성이 다양하게 이루어질 수 있다. 
각 항목마다 실행하는 화면의 시퀀스를 캡쳐하여 한글 파일로 제출하시오.  

	판매관리 메뉴 <여러분 팀이름: 학번-이름, 학번-이름, 학번-이름> :
	1. 매출
	2. 매입
	3. 재고
	항목을 선택하세요 : 1
*/






